{
    "marcin-zasepa": {
        "name": "Marcin Zasepa",
        "photo": "marcin-zasepa.jpg",
        "title": "Running Web Platform with no servers: Serverless in production",
        "description": "Serverless is a new technology, which promises faster business value delivery, reduced costs and simplified operations. As with every new technology, there is a promise of an added value on one side and the risk on another side. Being an early adopter can give your company advantage over your competitors, but does the serverless really full-fills its promise? What challenges will you encounter on your way to the first production-ready serverless microservices? I will try to provide you with an answer to this questions based on lessons we learned when implementing our first 100% serverless microservices, including deployment, code organisation, monitoring, logging, security and many other aspects which have to be approached in a different way in the new brave world of serverless.",
        "about": "Passionate about software development with focus on bringing the maximum value to the business with least effort. After many years as a freelance software developer working on different projects varying in size and domain, making his experience in small startup (which failed), big enterprises as BMW being at leadership positions there and running his own software-engineering company, he finally found his home at Homegate.ch as Technical Lead and accepted the challenged, together with the great team at Homegate.ch to reengineer the platform from monolith heritage system operated on ‘on-premise’ to serverless micro-services running on AWS, making it the clear number one real estate platform in Switzerland.  Family guy,  proud father of three, fan of triathlon and boxing. Loving mountains and pure nature, addicted to bicycling, Tech-Blogs and software-engineering staff."
    },
    "yan-cui": {
        "name": "Yan Cui",
        "photo": "yan-cui.jpg",
        "title": "Serverless - how did we get here, and where are we headed?",
        "description": "Serverless is all the rage these days, but how did we get here and why should businesses and developer care about serverless? In this talk, we will hear about Yan's journey from running on-prem servers to EC2, to containers, and finally to serverless. We will hear about the evolution of development practices and debunk some common misconceptions about serverless. We'll also get a glimpse of how we can build new kinds of businesses on top of serverless, and why FinDev might be an even bigger game changer for businesses than DevOps.",
        "about": "Yan is an experienced engineer who has run production workload at scale in AWS for nearly 10 years. He has been an architect and principal engineer with a variety of industries ranging from banking, e-commerce, sports streaming to mobile gaming. He has worked extensively with AWS Lambda in production, and has been helping various UK clients adopt AWS and serverless as an independent consultant. <br/> Yan is an AWS Serverless Hero and a regular speaker at user groups and conferences internationally. He is also the author of <a href='https://bit.ly/production-ready-serverless'>Production-Ready Serverless by Manning</a> and keeps an active blog at <a href='https://theburningmonk.com/'>https://theburningmonk.com</a>."
    },
    "denys-makogon": {
        "name": "Denys Makogon",
        "photo": "denys-makogon.jpg",
        "title": "Things you should know about Fn Project and Oracle Functions",
        "description": "Serverless architectures refer to applications that significantly depend on “cloud” services (knows as Backend as a Service) or on custom code that’s run in ephemeral runtime (Function as a Service or “FaaS”).<br/>To application developers, “serverless” mean app where some certain logic of it is still written by the developer but unlike traditional architectures or microservices is run in stateless compute runtime that is event-triggered, may only last for one invocation, and fully managed by a cloud. Serverless helps developers to transfer responsibility for keeping their apps up and running as well as scaling out their workload capacity without involving DevOps/Ops as we got used to.<br/>In this talk, we will go through two successful projects Oracle Function and Fn Project, it’s origin, features. etc. We will go into details regarding functions development process, distribution and go a little into technical details like performance, scaling.",
        "about": "Software enthusiast focused on developing and designing platform and software as a service application for clouds. He’s a principal software developer in Oracle, concentrating on product development along with bringing well-designed and production ready integration with clouds solutions, contributor to various open source projects, cloud-related technologies along having fun with IoT devices and photography. Denis is a regular attendee and speaker at OpenStack summits (Atlanta, Austin, Paris, Barcelona, Boston) and PyCon Hong Kong 2016, 2017, PyCon Italy 2018. co-author of OpenStack Application development, OpenStack Trove Essentials."
    },
    "michael-wittig": {
        "name": "Michael Wittig",
        "photo": "michael-wittig.jpg",
        "title": "Your Lambda function might execute twice. Be prepared!",
        "description": "Are you confused when scheduled Lambdas execute twice, SNS messages trigger an invocation three times, your handmade S3 inventory is out of sync because events occurred twice? Bad news: Sooner or later, your Lambda function executes multiple times. You have to prepare yourself! The reasons are system failures, retries on errors, and event sources that guarantee at-least-once delivery (e.g., CloudWatch Events, SNS, …). In this talk, you learn why Lambda functions might execute twice and what you can do about it focusing on Lambda, DynamoDB, and Kinesis Data Streams.",
        "about": "Michael Wittig is author of Amazon Web Services in Action (Manning). As an independent consultant, he helps his clients to gain value from Amazon Web Services. As a software engineer he develops cloud-native real-time web and mobile applications. He migrated the complete IT infrastructure of the first bank in Germany to AWS. He has expertise in distributed system development and architecture, with experience in algorithmic trading and real-time analytics."
    },
    "laurent-picard": {
        "name": "Laurent Picard",
        "photo": "laurent-picard.jpg",
        "title": "Building smarter solutions with machine learning, from magic to reality",
        "description": "<i>“Any sufficiently advanced technology is indistinguishable from magic.”</i> — Arthur C Clarke<br/>Well, machine learning can look like magic, but you don't need to be a data scientist or an ML researcher to develop with ML.<br/>So, what about making your solution smarter without any knowledge in AI? With pre-trained models and a few lines of code, machine learning APIs can analyze your data. Moreover, AutoML techniques can now help in getting even more specific insights tailored to your needs.",
        "about": "Laurent is a developer passionate about software, hardware, science and anything shaping the future. He works for Google where he ecstatically explores cloud technologies. In a previous life, he pioneered the ebook industry, co-created the 1st European ebook reader, and co-founded Bookeen. He now enjoys sharing his passion in international conferences. You can find him on twitter at @PicardParis."
    },
    "frank-munz": {
        "name": "Frank Munz",
        "photo": "frank-munz.jpg",
        "title": "2019 Update: Serverless Beyond Lambda",
        "description": "This presentation is a no-nonsense review of all new features and services around Lambda. Serverless is more than just AWS Lambda! I will review the full picture of services and new features: Starting with the open-sourced Firecracker mini-VM that spins up in 125ms, to serverless databases that can scale down to zero, Dynamo DB that does not need provisioned throughput anymore, to Lambda layers and custom runtimes that brings languages you always wanted like COBOL and PHP.<br/>Here is the deal: One feature/service = 5 minutes. Fast paced! Honest tech bits. Explained well. No vendor pitch. Promised!",
        "about": "In 2017, Frank travelled to a couple of not so safe countries teaching cloud workshops. He always dreamed to present at one conference at every single continent (maybe except Antarctica). Once he’d successfully completed this mission, he hired at AWS. Frank now works as a senior technical evangelist for AWS. He was nominated as Developer Champion 2017, holds several AWS certifications, a PADI advanced scuba diver certification, and a PhD in Computer Science with brain research.<br/>Before joining AWS, Frank was running his global boutique consultancy for over a decade. He is a published author of 3 cloud and middleware books. Real books, not screenshot books. He enjoys writing about himself in the third person."
    },
    "szilveszter-farkas": {
        "name": "Szilveszter Farkas",
        "photo": "szilveszter-farkas.jpg",
        "title": "How (not) to deploy serverless applications?",
        "description": "Serverless Framework, AWS SAM/Amplify, Terraform, Begin/Arc, Claudia.js, Zappa,... So many options, but which one to choose when it comes to automated deployment of serverless applications?<br/><br/>Our team started using AWS Lambda more than 3 years ago powering ops automation for a container-based product. Today all of our systems are running on top of it, consisting of about 40 services and 300+ Lambda functions, with some parts of the infrastructure running on Azure and Google Cloud.<br/><br/>The talk will feature some stories and learnings on how our deployment strategy has evolved over the years. It will also provide an answer to teams setting out on their serverless journey today, on which deployment tool they might want to use in order to get started on top of good foundations.",
        "about": "Szilveszter Farkas is a senior software developer in the <a href='https://www.rackspace.com'>Rackspace</a> Product Engineering group working on backend/API development. In his previous life he was one of the first engineers working on <a href='https://prezi.com'>Prezi</a>'s backend and infrastructure. He is passionate about serverless architectures and continuous delivery. Presented at various conferences and meetups in the USA and throughout Europe about scaling Django applications and deployment processes. Found home in Zurich, originating from Hungary via a few years spent in San Francisco. Proud father of a two-year-old who already knows more Swiss German than his dad."
    },
    "duy-moritz": {
        "name": "Duy Nguyen & Moritz Raho",
        "photo": "duy-moritz.jpg",
        "title": "Solving complex business use cases in a serverless way",
        "description": "Serverless computing gains popularity as it simplifies developers’ lives in many aspects: languages, deployment, infrastructure. But simplicity doesn’t mean inability to build complex workflows. In this talk, we will share our experience using Apache OpenWhisk to solve advanced business use cases.",
        "about": "Duy is a software engineer at Adobe R&D Switzerland in Basel. He is a member of Developer Ecosystem and Adobe I/O engineering team.<br/>His technical contribution at Adobe has focused on cloud platform and emerging technologies, including Adobe I/O Runtime serverless platform, Cloud Native Apps and SDKs, and research on applying serverless technologies in ML/AI.<br/>He is an active contributor in the Apache OpenWhisk (Incubator) project.<br/>When he is not working, you might find Duy with his backpack somewhere in the nature of Nepali mountains, or with his favorite book about Roman history.<br/><br/>Moritz is a young Software Engineer passionate about cloud technologies. After graduating from a master’s degree in CS at EPFL, he joined Adobe in Basel for new adventures. He now works for Adobe I/O a team providing solutions empowering developers looking to integrate, extend, or create apps based on Adobe’s technologies. His current role is to implement a SDK to help developers create cloud native apps backed by Adobe’s serverless infrastructure, which is built on top of Apache OpenWhisk."
    },
    "danilo-poccia": {
        "name": "Danilo Poccia",
        "photo": "danilo-poccia.jpg",
        "title": "Taking Serverless to the Next Level",
        "description": "What are the top best practices to build and run applications without thinking about servers? Model your serverless components as templates and deploy your infrastructure as config to leverage best practices such as code reviews. Step-through and debug your code with a local execution environment. Coordinate and manage the state of each distributed component. Continuously deliver your code in production using application lifecycle management tools. Enable gradual, safe deployments. To support our findings, we’ll review customer case studies to see what they did, why, and which benefits they got most.",
        "about": "Danilo works with startups and companies of any size to support their innovation. In his role as Evangelist at Amazon Web Services, he leverages his experience to help people bring their ideas to life, focusing on serverless architectures and event-driven programming, and on the technical and business impact of machine learning and edge computing. He is the author of AWS Lambda in Action from Manning."
    }

}