{
    "marcin-zasepa": {
        "name": "Marcin Zasepa",
        "photo": "marcin-zasepa.jpg",
        "title": "Running Web Platform with no servers: Serverless in production",
        "description": "Serverless is a new technology, which promises faster business value delivery, reduced costs and simplified operations. As with every new technology, there is a promise of an added value on one side and the risk on another side. Being an early adopter can give your company advantage over your competitors, but does the serverless really full-fills its promise? What challenges will you encounter on your way to the first production-ready serverless microservices? I will try to provide you with an answer to this questions based on lessons we learned when implementing our first 100% serverless microservices, including deployment, code organisation, monitoring, logging, security and many other aspects which have to be approached in a different way in the new brave world of serverless.",
        "about": "Passionate about software development with focus on bringing the maximum value to the business with least effort. After many years as a freelance software developer working on different projects varying in size and domain, making his experience in small startup (which failed), big enterprises as BMW being at leadership positions there and running his own software-engineering company, he finally found his home at Homegate.ch as Technical Lead and accepted the challenged, together with the great team at Homegate.ch to reengineer the platform from monolith heritage system operated on ‘on-premise’ to serverless micro-services running on AWS, making it the clear number one real estate platform in Switzerland.  Family guy,  proud father of three, fan of triathlon and boxing. Loving mountains and pure nature, addicted to bicycling, Tech-Blogs and software-engineering staff."
    },
    "yan-cui": {
        "name": "Yan Cui",
        "photo": "yan-cui.jpg",
        "title": "Serverless - how did we get here, and where are we headed?",
        "description": "Serverless is all the rage these days, but how did we get here and why should businesses and developer care about serverless? In this talk, we will hear about Yan's journey from running on-prem servers to EC2, to containers, and finally to serverless. We will hear about the evolution of development practices and debunk some common misconceptions about serverless. We'll also get a glimpse of how we can build new kinds of businesses on top of serverless, and why FinDev might be an even bigger game changer for businesses than DevOps.",
        "about": "Yan is an experienced engineer who has run production workload at scale in AWS for nearly 10 years. He has been an architect and principal engineer with a variety of industries ranging from banking, e-commerce, sports streaming to mobile gaming. He has worked extensively with AWS Lambda in production, and has been helping various UK clients adopt AWS and serverless as an independent consultant. <br/> Yan is an AWS Serverless Hero and a regular speaker at user groups and conferences internationally. He is also the author of <a href='https://bit.ly/production-ready-serverless'>Production-Ready Serverless by Manning</a> and keeps an active blog at <a href='https://theburningmonk.com/'>https://theburningmonk.com</a>."
    }

}